backend/controllers/SiteController.php

SELECT * FROM `kx_web` WHERE `status`='1' ORDER BY `id`
---
    private function get_web_array(){
        $web_list=Web::find()->where(['status'=>'1'])->orderBy('id ASC')->asArray()->all();

SELECT * FROM `kx_user` WHERE `id`=1
SELECT * FROM `kx_web` WHERE `status`=1
---
    public function actionIndex()
    {
        $session=Yii::$app->session;
        $user_id=Yii::$app->user->identity->getId();
        $user_info = Yii::$app->authManager->getRolesByUser($user_id);
        $menu = new Menu();
        $User_list=User::find()->where(['id'=>Yii::$app->user->identity->id])->asArray()->one();
//        var_dump($User_list);exit;
        $web_list=Web::find()->where(['status'=>1])->all();