backend/controllers/StockLogsController.php

    public function actionCreate()
    {
        $model = new StockLogs();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `kx_stock_logs` (`customer_id`, `purpose_id`, `status`, `remark`, `operation_time`, `current_number`, `stock_id`, `create_at`, `update_at`) VALUES (2, 6, 2, '8', '2018-10-09', '7', '9', '2018-12-11 00:24:49', '2018-12-11 00:24:49')