common/models/Stock.php

SELECT * FROM `kx_stock` WHERE `id`=7
---
    public static function get_total_number($id){
        $res=Stock::findOne($id);

UPDATE `kx_stock` SET `total_number`='-1' WHERE `id`='7'
---
    public static function update_total_number($id,$number,$action){
        if(empty($action)){
            return false;
        }
        $update=Stock::findOne($id);
        if($action=='plus'){
            $update->total_number=bcadd($update->total_number,$number);
        }
        if($action=='reduce'){
            $total_number=bcsub($update->total_number,$number);
            if($total_number >= "0"){
//                var_dump($total_number,2);exit;
                $update->total_number=$total_number;
            }else{
//                var_dump($total_number,3);exit;
                return 'insufficient';
            }
        }
        $res=$update->save();