common/models/Types.php

SELECT * FROM `kx_types` WHERE `id`='168'
---
    public static function getName($id){
        $res=Types::find()->where(['id'=>$id])->asArray()->one();