<?php
return [
    'upload_path' => 'http://59.110.215.21/concept_crm_test/concept_crm',
    'types_classs'=>[
        ''=>'-- 请选择 --',
        1001=>'规格-商品模块',
        1002=>'物品-商品模块',
        1003=>'单位-商品模块',
        1004=>'产品名称-商品模块',
        1005=>'客户类型-客户模块',
        1006=>'客户来源-客户模块',
        1007=>'客户状态-客户模块',
        1008=>'其他分类',
        1009=>'用途-库存模块',
        1010=>'品牌-商品模块',
//        1011=>'账务类型-财务模块',
        1012=>'账户类别-财务模块',
        1013=>'订单类型-订单模块',
        1014=>'归还原因-库存模块',
    ],

];
